# Задача 10: На столе лежат n монеток. Некоторые из них лежат вверх решкой, а некоторые – гербом.
# Определите минимальное число монеток, которые нужно перевернуть,
# чтобы все монетки были повернуты вверх одной и той же стороной.
# Выведите минимальное количество монет, которые нужно перевернуть.
# 5 -> 1 0 1 1 0
# 2

data = [int(i) for i in input("Введите числа 0 и 1 через пробел: ").split()]
zero_data = 0
one_data = 0
for i in range(len(data)):
    if data[i] > 1 or data[i] < 0:
        exit("Ошибка данных")
    if data[i] == 0:
        zero_data += 1
    else:
        one_data += 1
if zero_data < one_data:
    print(f"Перевернуть необходимо {zero_data} монеты")
else:
    print(f"Перевернуть необходимо {one_data} монеты")
